DataProcessors/DMS_WebSocket_Клиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>DMS_WebSocket_Клиент</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/DMS_WebSocket_ОчередьСообщенийДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_WebSocket_ОчередьСообщенийДляОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>message</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>full</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NameFrom</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>to</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_WebSocket_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_WebSocket_Сообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>message</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>full</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>to</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/DMS_WebSocket_Клиент/Forms/ФормаУФ/Ext/Form/Module.bsl
//--- работа с фоновыми заданиями -----------------------------------------------

#Область ЗапуститьФоновоеЗадание

&НаСервере
Процедура ЗапуститьФоновоеЗаданиеНаСервере()
	
	DMS_WebSocketСервер.ПроверитьИЗапуститьОбменWebSocket(Неопределено);
	Возврат;
	
	
	Попытка
		//ФоновоеЗадание = ФоновыеЗадания.Выполнить("DMS_WebSocketСервер.ЗапуститьРаботуВФоне", , КлючФоновогоЗадания, "DMS_WebSocket - работа в фоне");
		ПараметрыЗадания = Новый Массив;
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("DMS_WebSocketСервер.ПроверитьИЗапуститьОбменWebSocket", ПараметрыЗадания, КлючФоновогоЗадания, "DMS_WebSocket - работа в фоне");
		ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	Исключение
		Сообщить("DMS_WebSocket: ошибка запуска фонового задания для получения сообщений" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание(Команда)
	ЗапуститьФоновоеЗаданиеНаСервере();
КонецПроцедуры

#КонецОбласти	// ЗапуститьФоновоеЗадание


#Область ПолучитьСостояниеФоновогоЗадания

&НаКлиенте
Процедура ПолучитьСостояниеФоновогоЗадания(Команда)
	СостояниеФЗ = ПолучитьСостояниеФоновогоЗаданияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеФоновогоЗаданияНаСервере()
	Перем СостояниеФЗ, МассивФЗ;
	
	СостояниеФЗ = "Обмен через WebSocket не запущен";
	
	Если DMS_WebSocketСервер.ЕстьАктивныеФоновыеЗадания(МассивФЗ) Тогда
		СостояниеФЗ = "Обмен через WebSocket работает. Заданий активно, шт: " + МассивФЗ.Количество();
	КонецЕсли; 
	
	Возврат СостояниеФЗ;
	
КонецФункции

#КонецОбласти	// ПолучитьСостояниеФоновогоЗадания


#Область ОтменитьФоновоеЗадание

&НаСервере
Процедура ОтменитьФоновоеЗаданиеНаСервере()
	Перем МассивФЗ;
	
	Если DMS_WebSocketСервер.ЕстьАктивныеФоновыеЗадания(МассивФЗ) Тогда
		Для каждого ФоновоеЗадание Из МассивФЗ Цикл
			ФоновоеЗадание.Отменить();
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФоновоеЗадание(Команда)
	ОтменитьФоновоеЗаданиеНаСервере();
КонецПроцедуры

#КонецОбласти	// ОтменитьФоновоеЗадание

//--- отправка сообщений -----------------------------------------------

#Область ОтправкаСообщений

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	//ОтправитьСообщениеНаСервере();
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("from", ПсевдонимНаСервере);
	СтруктураСообщения.Вставить("to", destination);
	СтруктураСообщения.Вставить("type", "");
	СтруктураСообщения.Вставить("message", "");


	Очередь = РегистрыСведений.DMS_WebSocket_ОчередьСообщенийДляОтправки.СоздатьМенеджерЗаписи();
	ПодготовитьСтруктуруСообщения(СтруктураСообщения);
	ЗаполнитьЗначенияСвойств(Очередь, СтруктураСообщения);
	Очередь.ДатаСообщения = ТекущаяДата();
	Очередь.ИД = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Очередь.full = Новый ХранилищеЗначения(СтруктураСообщения);
	Очередь.Записать();

	//DMS_WebSocketСервер.ДобавитьСообщениеВОчередьСообщений(ПсевдонимНаСервере, destination, type, message);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСтруктуруСообщения(СтруктураСообщения)

	Если Метод =  "GetAvailableSlots" Тогда 
			
	ИначеЕсли Метод = "ReserveSlot" Тогда 
		ReserveSlotСтруктура(СтруктураСообщения);		
	ИначеЕсли Метод = "ApprovedReserveSlot" Тогда 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ReserveSlotСтруктура(СтруктураСообщения)
	
	СтруктураData = Новый Структура;
	
	СтруктураМодели = Новый Структура;
	СтруктураМодели.Вставить("VIN","");
	СтруктураМодели.Вставить("ModelCode",Модель);
	СтруктураМодели.Вставить("VersionCode","");
	СтруктураМодели.Вставить("FuelType","");
	СтруктураМодели.Вставить("EngineType","");
	СтруктураМодели.Вставить("AirConditioner",Истина);
	СтруктураМодели.Вставить("ABS",Истина);
	СтруктураМодели.Вставить("PowerSteering",Истина);
	СтруктураМодели.Вставить("CabinFilter",Истина);
	
	МассивКС=Новый Массив;
	МассивКС.Добавить(Новый Структура("ComplexPrice,ComplexName,ComplexID",10000,"Кс_Тест",КомплексСервис));
	
	МассивКСКоды=Новый Массив;
	МассивКСКоды.Добавить(КомплексСервис);
	
	СтруктураData.Вставить("SlotID",ЗаписьНаСлот);
	СтруктураData.Вставить("StartTime",ЗаписатьДатуJSON(ВремяНачала,ФорматДатыJSON.ISO,ВариантЗаписиДатыJSON.УниверсальнаяДата));
	СтруктураData.Вставить("FirstName",Имя);
	СтруктураData.Вставить("MiddleName",Отчество);
	СтруктураData.Вставить("LastName",Фамилия);
	СтруктураData.Вставить("Telephone",Телефон);
	СтруктураData.Вставить("Email","");
	СтруктураData.Вставить("Comment","");
	СтруктураData.Вставить("ContactClient",Истина);
	СтруктураData.Вставить("PersDataAgree",Истина);
	СтруктураData.Вставить("Odometer",1000);
	
	СтруктураData.Вставить("ModelDesc",СтруктураМодели);
	СтруктураData.Вставить("ComplexList",МассивКС);
	СтруктураData.Вставить("ComplexCodeList",МассивКСКоды);
	
	СтруктураСообщения.Вставить("Data",СтруктураData);

КонецПроцедуры




&НаКлиенте
Процедура ОтправитьЗапросГрафика(Команда)
	
	//ДилерскийЦентрСтрокой = DMS_WebSocketСервер.СериализоватьВСтрокуJSON(ДилерскийЦентр);
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	//СтруктураПараметров.Вставить("НачалоРабочегоДня", ВыборПериодаГрафика.ДатаНачала);
	//СтруктураПараметров.Вставить("КонецРабочегоДня", ВыборПериодаГрафика.ДатаОкончания);
	//
	//СтруктураПараметровСтрокой = DMS_WebSocketСервер.СериализоватьВСтрокуJSON(СтруктураПараметров);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДилерскийЦентр", ДилерскийЦентр.DMD);
	СтруктураПараметров.Вставить("Дата", ДатаГрафикаДилеркскогоЦентра);
	
	СтруктураПараметровСтрокой = DMS_WebSocketСервер.СериализоватьВСтрокуJSON(СтруктураПараметров);
	
	DMS_WebSocketСервер.ДобавитьСообщениеВОчередьСообщений(ПсевдонимНаСервере, destination, "ПолучитьГрафикЗанятостиДилерскогоЦентраНаДату", СтруктураПараметровСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросОстатка(Команда)
	
	//ОтправитьЗапросОстаткаНаСервере();
	DMS_WebSocketСервер.ДобавитьСообщениеВОчередьСообщений(ПсевдонимНаСервере, destination, "ПолучитьОстатокНоменклатуры", Номенклатура.Артикул);

КонецПроцедуры

#КонецОбласти	// ОтправкаСообщений

//--- прочие команды -----------------------------------------------

#Область КомандыФормы

&НаСервере
Процедура ПрочитатьКонстантыНаСервере()
	ПсевдонимНаСервере = Константы.DMS_WebSocket_ПсевдонимНаСервере.Получить();
	АдресСервера = Константы.DMS_WebSocket_АдресСервера.Получить();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрочитатьКонстантыНаСервере();
	//ПодключитьОбработчикОжидания("ОбновитьСостояния", 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//ОтменитьФоновоеЗаданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПсевдонимНаСервереПриИзмененииНаСервере()
	Константы.DMS_WebSocket_ПсевдонимНаСервере.Установить(ПсевдонимНаСервере);
КонецПроцедуры

&НаКлиенте
Процедура ПсевдонимНаСервереПриИзменении(Элемент)
	ПсевдонимНаСервереПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура АдресПодключенияПриИзмененииНаСервере()
	Константы.DMS_WebSocket_АдресСервера.Установить(АдресСервера);
КонецПроцедуры

&НаКлиенте
Процедура АдресПодключенияПриИзменении(Элемент)
	АдресПодключенияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛогСообщенийФЗ(Команда)
	ЛогСообщенийФЗ = "";
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьЛогСообщенийФЗНаСервере(ЛогСообщенийФЗ)
	Перем МассивФЗ;
	
	Если DMS_WebSocketСервер.ЕстьАктивныеФоновыеЗадания(МассивФЗ) Тогда
		Для каждого ФоновоеЗадание Из МассивФЗ Цикл
			МассивСообщений = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
			Для каждого Сообщение Из МассивСообщений Цикл
				ЛогСообщенийФЗ = ЛогСообщенийФЗ + Символы.ПС + Сообщение.Текст;
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЛогСообщенийФЗ(Команда)
	ОбновитьЛогСообщенийФЗНаСервере(ЛогСообщенийФЗ);
КонецПроцедуры

&НаКлиенте
Процедура СообщенияНЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	НаборЗаписей = РегистрыСведений.DMS_WebSocket_Сообщения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ВыбраннаяСтрока.ИД);
	НаборЗаписей.Отбор.ДатаСообщения.Установить(ВыбраннаяСтрока.ДатаСообщения);
	НаборЗаписей.Отбор.name.Установить(ВыбраннаяСтрока.name);
	НаборЗаписей.Отбор.to.Установить(ВыбраннаяСтрока.to);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл 
		СтруктураДанных = Запись.full.Получить();

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьСообщенийНЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	НаборЗаписей = РегистрыСведений.DMS_WebSocket_ОчередьСообщенийДляОтправки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ВыбраннаяСтрока.ИД);
	НаборЗаписей.Отбор.ДатаСообщения.Установить(ВыбраннаяСтрока.ДатаСообщения);
	НаборЗаписей.Отбор.name.Установить(ВыбраннаяСтрока.name);
	НаборЗаписей.Отбор.to.Установить(ВыбраннаяСтрока.to);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл 
		СтруктураДанных = Запись.full.Получить();
		Запись = новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, СтруктураДанных);
		
		ЛогСообщенийФЗ = Запись.Закрыть();	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Метод.СписокВыбора.Добавить("GetAvailableSlots","GetAvailableSlots");
	Элементы.Метод.СписокВыбора.Добавить("ReserveSlot","ReserveSlot");
	Элементы.Метод.СписокВыбора.Добавить("ApprovedReserveSlot","ApprovedReserveSlot");
КонецПроцедуры

&НаКлиенте
Процедура СообщенияНЗ1ПриАктивизацииСтроки(Элемент)
	ВыбраннаяСтрока = Элементы.СообщенияНЗ1.ТекущиеДанные;
	НаборЗаписей = РегистрыСведений.DMS_WebSocket_Сообщения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИД.Установить(ВыбраннаяСтрока.ИД);
	НаборЗаписей.Отбор.ДатаСообщения.Установить(ВыбраннаяСтрока.ДатаСообщения);
	НаборЗаписей.Отбор.name.Установить(ВыбраннаяСтрока.name);
	НаборЗаписей.Отбор.to.Установить(ВыбраннаяСтрока.to);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл 
		СтруктураДанных = Запись.full.Получить();
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтруктураДанных,Новый НастройкиСериализацииJSON);
	Ответ = ЗаписьJSON.Закрыть();

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТестовуюФормуБраузера(Команда)
	ОткрытьФорму("Обработка.DMS_WebSocket_Клиент.Форма.Форма");
КонецПроцедуры

#КонецОбласти //КомандыФормы


//&НаСервере
//Процедура ОтправитьСообщениеНаСервере()
//	DMS_WebSocketСервер.ДобавитьСообщениеВОчередьСообщений(type, message, ПсевдонимНаСервере, destination);
//КонецПроцедуры


//&НаСервере
//Процедура ОтправитьЗапросОстаткаНаСервере()
//	DMS_WebSocketСервер.ДобавитьСообщениеВОчередьСообщений("ПолучитьОстаток", Номенклатура.Артикул, ПсевдонимНаСервере, destination);
//	//DMS_WebSocketСервер.ОтправитьСообщенияИзОчереди(ПолучитьОбъектВебСокет());
//КонецПроцедуры


//&НаКлиенте
//Процедура ОбновитьСостояния()
//	
//	//СостояниеФЗ = ПолучитьСостояниеФоновогоЗаданияНаСервере(ИдентификаторФоновогоЗадания);
//	Элементы.ОчередьСообщенийНЗ.Обновить();
//	Элементы.СообщенияНЗ.Обновить();
//	
//КонецПроцедуры
